{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.9", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_4", "activity_regularizer": null, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 96, 96, 1], "filters": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_size": [2, 2], "name": "conv2d_5", "activity_regularizer": null, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "filters": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_size": [2, 2], "name": "conv2d_6", "activity_regularizer": null, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "filters": 128}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "trainable": true, "units": 500, "name": "dense_14", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "trainable": true, "units": 500, "name": "dense_15", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_15", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "trainable": true, "units": 30, "name": "dense_16", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}]}