{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.9", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "trainable": true, "units": 100, "name": "dense_9", "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 9216], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "trainable": true, "units": 30, "name": "dense_10", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}}}]}