{"keras_version": "2.0.9", "backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "units": 100, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "name": "dense_1", "kernel_regularizer": null, "activation": "linear", "batch_input_shape": [null, 9216], "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "units": 30, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}