{"keras_version": "2.0.9", "backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [3, 3], "filters": 32, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "name": "conv2d_1", "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "batch_input_shape": [null, 96, 96, 1], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "kernel_size": [2, 2], "bias_regularizer": null, "filters": 64, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "kernel_size": [2, 2], "bias_regularizer": null, "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "units": 500, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "units": 500, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_4", "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "units": 30, "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_5", "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}