{"config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "dtype": "float32", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 9216], "name": "dense_7", "activity_regularizer": null, "units": 100}, "class_name": "Dense"}, {"config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_8", "activity_regularizer": null, "units": 30}, "class_name": "Dense"}], "keras_version": "2.0.9", "class_name": "Sequential", "backend": "tensorflow"}